<template>
    <div>
        <!-- Start Generic Area -->
			<section class="about-generic-area pt-100" id="autobio">
				<div class="container border-top-generic">
					<h1 class="about-title mb-30" id="abi">{{$t('autobiography.title')}}</h1>
					<div class="row">
                        <div class="col-md-12" v-for="(item,key) in descriptionList" :key="key">
                              <div class="img-text">
                                  <p>{{item}}</p>
                              </div>
                        </div>					
					</div>
				</div>
			</section>
			<!-- End Generic Start -->	
    </div>
</template>
<script>
export default {
    data(){
        return{
            descriptionList:[
                 '成長於小康家庭，雙親從事小本自營生意，我與家中一姊一弟相處極為融洽。父母除了重視子女教育外，平常更灌輸我們飲水思源的觀念及培養獨立自主的思考。',
                 '大學期間無論是從事兼職工作或是參與社團事務，都秉持全力配合及負責到底的態度。在學期間，我發現團體合作的重要性更學會如何與不同個性的人相處，也因此更偏好具有挑戰性且能和人接觸的工作。',
                 '大學畢業之後，從事室內設計。由於該工作性質，需與客戶及上級主管直接面對面溝通，讓我深刻體會到團隊合作的重要性，單打獨鬥很難順利完成案子。',
                 '累積幾年的工作經驗後，希望能充實自己，且長期對資訊相關產業抱有極大的興趣，因此選擇前往澳洲雪梨科技大學攻讀資訊工程研究所。回台灣後，為了更精進程式相關領域，於恆逸教育訓練中心進修，更奠定程式語言的基礎，包括C#到網頁前端JavaScript、jQuery、網頁架構HTML、網頁美工Bootstrap、資料庫T-SQL及ASP.NET和MVC等技術。將所學知識與技巧從無到有整合到專案裡，我在開發學習過程中獲得成就感。',
                 '未來的生涯規劃方面，目前我最渴望的就是接受更大的挑戰，獲得更多元化的實務經驗。若沒有實際地嘗試，將永遠僅限於紙上談兵，而無法了解IT市場真正的需求。',
                 '而最終的職業規劃目標，則是成為一位專業的程式設計師，透過不斷更新並增進自己的能力，提供最具效能且兼顧效率的專業技能，完成公司的使命。',
                 '『工作經歷』',
                 '進入IT職場的第一份工作為專案公司程式設計，從不太熟悉MVC架構，到完全能靈活運用在不同專案上。期間也從小的專案維護（美科美髮維護系統）及API 八字APP撰寫，到新專案環球專利網站及世一購物網站的開發。而上述工作流程及處理問題的經驗包含UX使用者流程及從設計師端取得網頁後要進行有效率的網頁切版等。',
                 '第二份服務公司為經貿聯網，本人主要負責台新銀行信用卡收單系統的委外開發及維護、C#程式設計與StoredProcedure程式開發。',
                 '第一年負責台新銀行收單系統維護及台新信用卡收單需求開發，工作內容針對既有系統維護及調整效能和問題處理與台新Discover程式開發。',
                 '第二年負責台新收單系統轉換自建案APSS，主要職責為付款作業、周邊客製化功能及報表開發。',
                 '第三、四年負責特店進件系統維運及需求開發，主要著重在特店異動比對差異、特店費率及分期設定，讓收單系統在晚間可進行資料同步及帳務清算。',
                 '在此四年實戰經驗的磨練下，本人對信用卡收單流程瞭若指掌。',
                 '『動機＋自我期許』',
                 '冀望能夠有機會與主管們進一步討論個人程式技能、專案經驗及信用卡等相關工作背景，並進入貴公司的大家庭發揮所長。我定盡力配合公司政策與規劃，達成目標。',
       ],
        }
    },
}
</script>
<style lang="scss" scoped>
#abi{
font-weight:bold;
font-family: "Segoe UI","微軟正黑體",sans-serif;
 text-align: center;
}

</style>